In [1]:
import pandas as pd

In [3]:
line1 = pd.read_csv('data/items.csv').head()

In [5]:
line1

   item_nbr        family  class  perishable
0     96995     GROCERY I   1093           0
1     99197     GROCERY I   1067           0
2    103501      CLEANING   3008           0
3    103520     GROCERY I   1028           0
4    103665  BREAD/BAKERY   2712           1

In [10]:
train = pd.read_csv('data/train_sample1.csv')

In [11]:
train.head()

   id      date  store_nbr  item_nbr  unit_sales  onpromotion
0   0  1/1/2013         25    103665         7.0          NaN
1   1  1/1/2013         25    105574         1.0          NaN
2   2  1/1/2013         25    105575         2.0          NaN
3   3  1/1/2013         25    108079         1.0          NaN
4   4  1/1/2013         25    108701         1.0          NaN

In [12]:
train['date'].unique()

array(['1/1/2013', '1/2/2013', '1/3/2013', '1/4/2013', '1/5/2013',
       '1/6/2013', '1/7/2013', '1/8/2013', '1/9/2013', '1/10/2013',
       '1/11/2013', '1/12/2013', '1/13/2013', '1/14/2013', '1/15/2013',
       '1/16/2013', '1/17/2013', '1/18/2013', '1/19/2013', '1/20/2013',
       '1/21/2013', '1/22/2013', '1/23/2013', '1/24/2013', '1/25/2013',
       '1/26/2013', '1/27/2013'], dtype=object)

In [20]:
len(train['store_nbr'].unique())

46

In [25]:
train.describe()

                 id     store_nbr      item_nbr    unit_sales  onpromotion
count  1.048575e+06  1.048575e+06  1.048575e+06  1.048575e+06          0.0
mean   5.242870e+05  2.648310e+01  6.177409e+05  8.750810e+00          NaN
std    3.026977e+05  1.648729e+01  3.035138e+05  1.973412e+01          NaN
min    0.000000e+00  1.000000e+00  9.699500e+04 -1.680000e+02          NaN
25%    2.621435e+05  1.000000e+01  3.580960e+05  2.000000e+00          NaN
50%    5.242870e+05  2.700000e+01  5.894030e+05  4.000000e+00          NaN
75%    7.864305e+05  4.300000e+01  8.745930e+05  9.000000e+00          NaN
max    1.048574e+06  5.400000e+01  1.118683e+06  5.219785e+03          NaN

In [33]:
len(train[train.unit_sales < 0].unit_sales)

70

In [36]:
list(train[train.unit_sales < 0].unit_sales)

[-3.0,
 -1.0,
 -3.0,
 -19.0,
 -27.0,
 -8.0800000000000001,
 -8.516,
 -2.0,
 -1.0,
 -1.0,
 -7.0,
 -1.0,
 -2.0,
 -1.0,
 -1.0,
 -8.0,
 -17.0,
 -2.0,
 -10.0,
 -1.0,
 -1.0,
 -23.0,
 -5.0,
 -5.0,
 -10.0,
 -3.0,
 -1.0,
 -1.0,
 -20.0,
 -10.0,
 -149.0,
 -11.0,
 -35.0,
 -3.0,
 -3.0,
 -1.0,
 -5.0,
 -6.0,
 -34.0,
 -103.0,
 -96.0,
 -99.0,
 -6.0,
 -168.0,
 -36.0,
 -1.0,
 -1.0,
 -1.0,
 -6.5910000000000002,
 -1.885,
 -1.0,
 -4.0,
 -3.0,
 -0.29100000000000004,
 -0.17199999999999999,
 -4.0,
 -1.0,
 -5.0,
 -9.0,
 -2.0,
 -6.0,
 -1.0,
 -1.0,
 -1.0,
 -14.904999999999999,
 -1.702,
 -1.1159999999999999,
 -6.0,
 -3.0,
 -1.0]

In [37]:
train.head()

   id      date  store_nbr  item_nbr  unit_sales  onpromotion
0   0  1/1/2013         25    103665         7.0          NaN
1   1  1/1/2013         25    105574         1.0          NaN
2   2  1/1/2013         25    105575         2.0          NaN
3   3  1/1/2013         25    108079         1.0          NaN
4   4  1/1/2013         25    108701         1.0          NaN

In [38]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 6 columns):
id             1048575 non-null int64
date           1048575 non-null object
store_nbr      1048575 non-null int64
item_nbr       1048575 non-null int64
unit_sales     1048575 non-null float64
onpromotion    0 non-null float64
dtypes: float64(2), int64(3), object(1)
memory usage: 44.0+ MB

In [41]:
len(list(train[train.unit_sales < 1].unit_sales))

3102

In [42]:
train.describe()

                 id     store_nbr      item_nbr    unit_sales  onpromotion
count  1.048575e+06  1.048575e+06  1.048575e+06  1.048575e+06          0.0
mean   5.242870e+05  2.648310e+01  6.177409e+05  8.750810e+00          NaN
std    3.026977e+05  1.648729e+01  3.035138e+05  1.973412e+01          NaN
min    0.000000e+00  1.000000e+00  9.699500e+04 -1.680000e+02          NaN
25%    2.621435e+05  1.000000e+01  3.580960e+05  2.000000e+00          NaN
50%    5.242870e+05  2.700000e+01  5.894030e+05  4.000000e+00          NaN
75%    7.864305e+05  4.300000e+01  8.745930e+05  9.000000e+00          NaN
max    1.048574e+06  5.400000e+01  1.118683e+06  5.219785e+03          NaN

In [43]:
train.date=pd.to_datetime(train.date)

In [44]:
train.head()

   id       date  store_nbr  item_nbr  unit_sales  onpromotion
0   0 2013-01-01         25    103665         7.0          NaN
1   1 2013-01-01         25    105574         1.0          NaN
2   2 2013-01-01         25    105575         2.0          NaN
3   3 2013-01-01         25    108079         1.0          NaN
4   4 2013-01-01         25    108701         1.0          NaN

In [48]:
train_grouped = train.groupby('date')

In [50]:
train_grouped.count()

               id  store_nbr  item_nbr  unit_sales  onpromotion
date
2013-01-01    578        578       578         578            0
2013-01-02  41676      41676     41676       41676            0
2013-01-03  40100      40100     40100       40100            0
2013-01-04  40048      40048     40048       40048            0
2013-01-05  42534      42534     42534       42534            0
2013-01-06  41873      41873     41873       41873            0
2013-01-07  39300      39300     39300       39300            0
2013-01-08  39131      39131     39131       39131            0
2013-01-09  39036      39036     39036       39036            0
2013-01-10  38358      38358     38358       38358            0
2013-01-11  39255      39255     39255       39255            0
2013-01-12  42174      42174     42174       42174            0
2013-01-13  42141      42141     42141       42141            0
2013-01-14  39323      39323     39323       39323            0
2013-01-15  39670      39670     39670       39670            0
2013-01-16  40085      40085     40085       40085            0
2013-01-17  39162      39162     39162       39162            0
2013-01-18  39802      39802     39802       39802            0
2013-01-19  43416      43416     43416       43416            0
2013-01-20  42394      42394     42394       42394            0
2013-01-21  40061      40061     40061       40061            0
2013-01-22  39409      39409     39409       39409            0
2013-01-23  39447      39447     39447       39447            0
2013-01-24  38587      38587     38587       38587            0
2013-01-25  39878      39878     39878       39878            0
2013-01-26  43273      43273     43273       43273            0
2013-01-27  37864      37864     37864       37864            0

In [55]:
len(train.item_nbr.unique()) *len(train.store_nbr.unique())

74244

In [56]:
train.head()

   id       date  store_nbr  item_nbr  unit_sales  onpromotion
0   0 2013-01-01         25    103665         7.0          NaN
1   1 2013-01-01         25    105574         1.0          NaN
2   2 2013-01-01         25    105575         2.0          NaN
3   3 2013-01-01         25    108079         1.0          NaN
4   4 2013-01-01         25    108701         1.0          NaN